import 'package:classified_app/pallets.dart';
import 'package:flutter/material.dart';

class PolicyScreen extends StatelessWidget {
  const PolicyScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 0,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.symmetric(horizontal: Pallets.defaultPadding),
          child: Column(
            children: [
              Text(
                "শর্তাবলী",
                style: TextStyle(
                  fontFamily: Theme.of(context).textTheme.headline5!.fontFamily,
                  fontSize: 35.00,
                ),
              ),
              Text(
                "Bikroy.com সল্টসাইট টেকনোলজিস এবি (Saltside Technologies AB) কর্তৃক প্রদত্ত একটি সার্ভিস (নিচের লিখিত শর্তাবলী প্রতিপালন সাপেক্ষে)। অনুগ্রহ করে এই ওয়েবসাইট ব্যবহার করার পূর্বে শর্তাবলী সম্পর্কে ভালো ভাবে জেনে নিন।",
                style: TextStyle(),
              ),
              Divider(height: 40),
              Text(
                "সাধারণ শর্তাবলী",
                style: TextStyle(
                  fontFamily: Theme.of(context).textTheme.headline5!.fontFamily,
                  fontSize: 25.00,
                ),
              ),
              Text(
                "Bikroy.com- এ বিজ্ঞাপন দেয়ার জন্য বিষয়বস্তু, লেখা, ছবি, গ্রাফিক্স এবং ভিডিও (“বিষয়বস্তু”) আপলোড করার সময় প্রযোজ্য সকল আইনকানুন মেনে চলার দায়িত্ব বর্তায় বিজ্ঞাপনদাতা এবং ব্যবহারকারীদের উপর। এসকল বিষয়বস্তু বেআইনি হলে এবং এতে অসত্য তথ্য থাকলে Bikroy.com এবং সল্টসাইট টেকনোলজিস এবি দায়বদ্ধ নয়।\r\n\nবিজ্ঞাপনদাতা এবং ব্যবহারকারীগণ নিশ্চয়তা প্রদান করেন যে, বিজ্ঞাপনের বিষয়বস্তু কোনো স্বত্বাধিকার, মেধা সম্পত্তির অধিকার এবং কোনো ব্যক্তি বা সত্তার অন্য কোনো অধিকার লঙ্ঘন করে না। বিজ্ঞাপনদাতা এবং ব্যবহারকারীগণ এই মর্মে আরো সম্মতি প্রদান করেন যে, এই সার্ভিস গ্রহণের কারনে উদ্ভূত সকল বাধ্যবাধকতা, দায়- দায়িত্ব এবং দাবি থেকে Bikroy.com এবং সল্টসাইট টেকনোলজিস এবি সম্পূর্ণভাবে মুক্ত।\r\n\nবিজ্ঞাপনদাতারা সম্মতি প্রদান করেন যে, তাদের প্রদানকৃত বিষয়বস্তু Bikroy.com-এর শর্তাবলী মেনে Bikroy.com-এর অংশীদার সাইটসমূহে উপস্থাপন করা যেতে পারে।",
                style: TextStyle(),
              ),
              Text(
                "স্বত্বাধিকার",
                style: TextStyle(
                  fontFamily: Theme.of(context).textTheme.headline5!.fontFamily,
                  fontSize: 25.00,
                ),
              ),
              Text(
                "বর্তমানে পরিচিত বা ভবিষ্যতে আবিষ্কার হতে পারে এমন কোনোভাবে, মাধ্যমে বা প্রযুক্তিতে এসকল বিষয়বস্তু ব্যবহার করা, নকল করা, পরিবর্তন সাধন করা, খাপ খাওয়ানো, প্রকাশ করা, অনুবাদ করা, ব্যুৎপত্তিমূলক কাজ তৈরি করা এবং সেগুলো অন্তর্ভুক্ত ও বিতরণ করার ক্ষেত্রে বিজ্ঞাপনদাতাগণ Bikroy.com এবং সল্টসাইট টেকনোলজিস এবি কে চিরস্থায়ীভাবে, শুল্কমুক্ত, অপরিবর্তনীয়, একচেটিয়া নয় এমন অধিকার এবং লাইসেন্স অনুমোদন করেন।\n\n\rBikroy.com- এর অন্তর্ভুক্ত উপাদান (এর বিষয়বস্তু, এবং অন্য কোনো সামগ্রী, সফটওয়্যার বা সার্ভিস সমূহ) সল্টসাইট টেকনোলজিস এবি, এর সাবসিডিয়ারি, অ্যাফিলিয়েট এবং/বা লাইসেন্সধারীরা তৃতীয় পক্ষের সম্পত্তি। ওয়েব সাইটের যেকোনো ধরনের মেধাস্বত্ব অধিকার যেমন স্বত্বাধিকার, ট্রেডমার্ক, সার্ভিস মার্ক, ব্যবসায়িক নাম এবং পৃথককারী অন্যান্য ব্রান্ড সল্টসাইট টেকনোলজিস এবি’র সম্পত্তি। উল্লেখ্য যে, সল্টসাইট টেকনোলজিস এবি-এর লিখিত অনুমতি ছাড়া এই সাইটের কোন বিষয় নকল, পুনঃব্যবহার, পুনরায় প্রকাশ, ইন্সটল, পোস্ট, স্থানান্তর, সংরক্ষণ কিংবা আদান-প্রদান করা যাবে না।",
                style: TextStyle(),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
